_posts/note/2013-02-13-How-to-create-article-contents-by-js.html
---
layout: doc
title: How To Create Article Contents By JS
subtitle: 如何动态生成文章目录
categories: note
tags: javascript
---


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 动态生成文章目录过程</a>
<ul>
<li><a href="#sec-2-1">2.1 编程思路</a></li>
<li><a href="#sec-2-2">2.2 js部分代码</a></li>
<li><a href="#sec-2-3">2.3 css部分代码</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">前言</h2>
<div class="outline-text-2" id="text-1">

<p>在搭建此次博客时，很想用javascript生成文章的目录，方便阅读，本来自己写了一个，
不过看到 <a href="http://beiyuu.com/">BeiYuu</a> 的文章 <a href="http://beiyuu.com/why-blog/">《我为什么写博客？》</a> 的文章目录时，
感觉自己写得没有他的好，于是参考他写的，写了下面的文章内容。
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">动态生成文章目录过程</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">编程思路</h3>
<div class="outline-text-3" id="text-2-1">

<p>总体上，思路就是你想的那个样子：
1.当页面加载完毕之后，使用js将h1, h2, h3&hellip;等标签中的内容和id（原文作者记录的是标题的位置）提取出来，可以存入数组。
2.设置相应的目录的容器，说白了就是相应的HTML,CSS。
3.使用js设置HTML a rel Attribute,不过这里原文作者是直接记录标题的位置，而不是使用href="#{id}",不过这点细节没有什么大的影响。将数组的内    容放入相应的位置。
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">js部分代码</h3>
<div class="outline-text-3" id="text-2-2">

<p>由于js部分有些许长，这里直接给出我repo中的
[生成目录JS代码](<a href="https://github.com/creamidea/creamidea.github.com/blob/master/_includes/article_contents.html">https://github.com/creamidea/creamidea.github.com/blob/master/_includes/article_contents.html</a>).
下面只是贴出如何提取出标题内容的js代码
</p>


<pre class="example">$.each($('h2,h3'),function(index,item){
    if(item.tagName.toLowerCase() == 'h2'){
          var h2item = {};
          h2item.name = $(item).text();
          h2item.id = 'menuIndex'+index;
          h2.push(h2item);
          h2index++;
    }else{
          var h3item = {};
          h3item.name = $(item).text();
          h3item.id = 'menuIndex'+index;
          if(!h3[h2index-1]){
            h3[h2index-1] = [];
          }
          h3[h2index-1].push(h3item);
    }
    item.id = 'menuIndex' + index
});
</pre>

<div class="note warning">
  <strong>从代码上可以看出，必须要一个二级标题,markdown: "**  **", HTML标签："h2",这点需要记住！</strong>
</div>

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">css部分代码</h3>
<div class="outline-text-3" id="text-2-3">




<pre class="example">/* Article Contents */
#menuIndex {
    position: fixed;
    bottom: 88px;
    right: 20px;
    width: 200px;
    overflow: auto;
    max-height: 602px;
}

#menuIndex ul {
    list-style: none;
}

#menuIndex ul li {
    font-size: 12px;
    margin-bottom: 5px;
    word-wrap: break-word;
    padding-left: 10px;
}

#menuIndex li.h1 {
    font-size: 14px;
    font-weight: normal;
    padding-left: 0;
    margin-bottom: 10px;
}

#menuIndex li.h3 {
    padding-left: 25px;
}

#menuIndex ul li.on {
    /*这里设置当前的标签的背景颜色，请根据自己的博客主色调具体情况修改*/
    background-color: rgb(37, 28, 28); 
}
</pre>


<p>
你有任何问题随时可以联系我
</p></div>
</div>
</div>
